Revit 2024 API
ColorPreset Enumeration
 Preset values of initial colors for specific lighting types
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ColorPreset
Visual Basic
Public Enumeration ColorPreset
Visual C++
public enum class ColorPreset
Members
Member name | Description
D65 |  D65.
D50 |  D50.
Halogen |  Halogen.
Incandescent |  Incandescent.
Xenon |  Xenon.
Quartz |  Quartz.
FluorescentWarm |  F4 fluorescent warm white.
FluorescentCool |  F4 fluorescent cool white.
FluorescentWhite |  F4 fluorescent white.
FluorescentDayLight |  F4 fluorescent day light.
FluorescentLightWhite |  F4 fluorescent light white.
MetalHalide |  Metal halide.
HighPressureSodium |  High pressure sodium.
LowPressureSodium |  Low pressure sodium.
Mercury |  Mercury.
PhosphorMercury |  Phosphor mercury.
See Also
Autodesk.Revit.DB.Lighting Namespace